//=========================================
// 
// 共通処理の設定
// エフェクトで使用する処理
// Author YudaKaito
// 
//=========================================
//-----------------------------------------
// include
//-----------------------------------------
#include "common_effect.h"

//********************************************************************************
// SRandFloatの乱数結果を反映
// 引数１　乱数が設定出来る float型
// 引数２　値
// 備考
//	乱数が使用する場合は、引数２の値を乱数の値に変更する。
//	乱数が使用しない場合は、何も値も変更しない。
//********************************************************************************
void SetRandom(FRandFloat* fluct, float* fValue)
{
	if (fluct->bIsRandom)	// 乱数が使用されている
	{
		*fValue = (rand() / (float)RAND_MAX) * (fluct->fMax - fluct->fMin) + fluct->fMin;
	}
}

//********************************************************************************
// SRandIntの乱数結果を反映
// 引数１　乱数が設定出来る int型
// 引数２　値
// 備考
//	乱数が使用する場合は、引数２の値を乱数の値に変更する。
//	乱数が使用しない場合は、何も値も変更しない。
//********************************************************************************
void SetRandom(FRandInt* fluct, int* nValue)
{
	if (fluct->bIsRandom)	// 乱数が使用されている
	{
		*nValue = (int)((rand() / (float)RAND_MAX) * (fluct->nMax - fluct->nMin)) + fluct->nMin;
	}
}