//**************************************************************************************************
//
// エフェクトの書き込み処理
// Auther：Yuda Kaito
//
//**************************************************************************************************
//************************************************************
// include
//************************************************************
#include "SaveEffect.h"

//********************************************************************************
// エフェクトのセーブ処理
//********************************************************************************
void SaveEffect(Effect effect)
{
	FILE * pFile;

	// 作ってない状態に変更
	effect.bUse = false;
	effect.nCntAnim = 0;

	//ファイルを開く
	pFile = fopen("data/FILE/Particle4.bin", "wb");

	if (pFile != NULL)
	{// ファイルが開いた場合
		// ファイルの書き込み
		fwrite(&effect, sizeof(Effect), sizeof(effect), pFile);
		//ファイルを閉じる
		fclose(pFile);
	}
	else
	{//ファイルが開けない場合
		printf("\n * * * ファイルが開けません * * * \n");
	}
}